docs/design/design.md
```mermaid
sequenceDiagram
autonumber
actor User
participant Device
participant Agent
participant Operator

User ->> Device: Boot Flotta device ISO with registration certificates
Device ->> Agent: Start Yggdrasil agent
Agent ->> Operator: Send registration request
Operator ->> "EdgeDevice CR": Create
Operator ->> Agent: Pairing confirmation with new certificates signed
Operator ->> OBC: Create Object Bucket Claim for the device data
Operator ->> "EdgeDevice CR": Update status with OBC info
Note over Device,Operator: New HTTPS MTLS connection
Agent ->> Agent: Start processing requests

loop Daemon loop each minute
Agent ->> Operator: Sending Heartbeats
Operator ->> Agent: 200 OK
end
```
